In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv("https://bit.ly/2nNFoRe",
                na_values={ "price":["?", "NA", "-"], "engine-type":["*"]  })
df.head(15)

In [ ]:
df.tail()

In [ ]:
df[:][ df["price"] == df["price"].max() ]

In [ ]:
df[:][ df["horsepower"] >= 200 ]

In [ ]:
car_manuf = df.groupby('company')
cars_audi = car_manuf.get_group('audi')
cars_audi

In [ ]:
df[:][ df["company"]=="audi"  ]

In [ ]:
s = df["company"].value_counts()
s

In [ ]:
# Å›rednia z serii
prices = df['price']

In [ ]:
print("Avg: ",prices.mean())
print("Median: ",prices.median())

In [ ]:
df[:][ df["price"] > df['price'].mean() ]

In [ ]:
car_manuf = df.groupby('company')
car_manuf['company','average-mileage'].mean()

In [ ]:
df.sort_values(['price', 'wheel-base'], ascending=[False,True]).head()

In [ ]:
df['length'] = round( df['length']*2.54 / 100 , 2)

In [41]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,4.29,dohc,four,111,21,NaN
1,1,alfa-romero,convertible,88.6,4.29,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,4.35,ohcv,six,154,19,NaN
3,3,audi,sedan,99.8,4.49,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,4.49,ohc,five,115,18,NaN

In [42]:
nc = df["num-of-cylinders"]

In [43]:
nc.unique()

array(['four', 'six', 'five', 'three', 'twelve', 'two', 'eight'],
      dtype=object)

In [48]:
def noc_cylinders(n):
    #list_w = ['four', 'six', 'five', 'three', 'twelve', 'two', 'eight']
    #list_nr = [ 4, 6, 5, 3, 12, 2, 8]
    #x = list_w.index(n)
    word_2_nr = { 'four':4, 'six':6, 'five':5, 'three':3, 'twelve':12, 'two':2, 'eight':8 }
    return word_2_nr.get(n, -1)

df["num-of-cylinders"] = nc.apply(noc_cylinders)

In [49]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,4.29,dohc,4,111,21,NaN
1,1,alfa-romero,convertible,88.6,4.29,dohc,4,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,4.35,ohcv,6,154,19,NaN
3,3,audi,sedan,99.8,4.49,ohc,4,102,24,13950.0
4,4,audi,sedan,99.4,4.49,ohc,5,115,18,NaN

In [50]:
del(df["index"])

In [51]:
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,4.29,dohc,4,111,21,NaN
1,alfa-romero,convertible,88.6,4.29,dohc,4,111,21,16500.0
2,alfa-romero,hatchback,94.5,4.35,ohcv,6,154,19,NaN
3,audi,sedan,99.8,4.49,ohc,4,102,24,13950.0
4,audi,sedan,99.4,4.49,ohc,5,115,18,NaN

In [57]:
german_cars = { 'Company' : ['Audi', 'BMW', 'VW', 'Mercedes'], 'Price' : [123, 176, 99, 250]  }
jpn_cars = { 'Company' : ['Toyota', 'Honda', 'Nissan', 'Mitsubishi'], 'Price' : [98, 88, 140, 100] }
df1 = pd.DataFrame.from_dict(german_cars)
df2 = pd.DataFrame.from_dict(jpn_cars)
df = pd.concat([df1, df2], keys=['Germany', 'Japan'])

In [65]:
df_ger = (df.loc['Germany'])

In [73]:
df_ger.iloc[1]["Price"]
# df_ger.iloc[1].Price - teÅ¼ OK

176